app/controllers/articles_controller.rb

  def index
    @articles = Article.order(created_at: :desc)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

  def update
    @article.assign_attributes(article_params)
    if @article.save
---
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "どうぶつの森"], ["body", "お魚釣り"], ["updated_at", "2020-04-12 06:21:05.263367"], ["id", 4]]

  def destroy
    if @article.destroy
      redirect_to root_path, notice: "削除に成功しました。"
    else
      redirect_to root_path, alert: "削除できませんでした。"
    end
  end

  private def find_article
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]